Repository: acloudmovingby/Translation-Assistance-Tool
Catalog: Import Files/th_en_batch_1_fixed_chunk5.csv-650387.tmx
Source language: th_th
Languages: en_us

source: งานราตรีสโมสร ย้อนยุคจอมพล ป....
en_us: the club's formal ball returns to the age of Chomphol P....

source: ช่วยคุณประหยัดเวลา เพียงแค่ ทำการบ้าน โดยเจียดเวลาเพียงเล็กน้อย เพื่อค้นหา ข้อมูลที่พัก จากเว็บของเรา
en_us: only helps you save time doing homework by giving only a little spare time to search for guesthouse information from our website.

source: ซึ่งคุณสามารถเนรมิตโครงสร้างและโพรงเพื่อเข้าไปเล่นภายในได้
en_us: You can invent structures and burrows to play in.

source: ดาวน์โหลดแบบทำโมเดลกระดาษฟรี
en_us: download the design to make paper models for free

source: ตรวจสอบสถานะงานซ่อมผ่านเว็บไซต์ได้เช่นกัน
en_us: can likewise verify the repair status on the website

source: ถ.รามคำแหง (ติดบิ๊กซี) เริ่มที่ 5,900 โทร 02-3693999
en_us: Ramkhamhaeng Rd. (next to Big C) beginning at 5,900 ph. 02-3693999

source: ถ.ศรีนครินทร์ สวนหลวง ราคาพิเศษ!
en_us: Srinakarin Rd., Suan Luang. Special price!

source: ทางอินเตอร์เน็ทไปใช้ดำเนินการอย่างไร
en_us: how to carry out tasks online

source: ที่เป็นสไตล์ของคุณเอง
en_us: which is in your own style

source: รวมไปจนถึงวิดีโอคอล
en_us: even including video call

source: รองเท้าสตั๊ดฟุตบอลบุรุษสำหรับพื้นแข็ง
en_us: men's soccer cleats for hard ground

source: ร่วมถึงปริศนาต่างๆเกี่ยวข้องกับเธอ...
en_us: including puzzles involving her...

source: วิทยุออนไลน์ประเทศไทย เล่นวิทยุไทย เอฟเอ็ม/เอเอ็ม
en_us: online Thai radio, play Thai radio AM/FM

source: สำหรับคนที่ไม่เคยทำโมเดลกระดาษมาก่อน
en_us: for those who have never made paper models before

source: หรือเป็นการเข้าถึงที่กฎหมายท้องถิ่นไม่ได้กำหนดไว้
en_us: or is a kind of access not defined by local laws

source: หากถามถึงผลิตภัณฑ์ที่เด่นของแบรนด์นี้
en_us: in regards to the notable products of this brand

source: อินเตอร์เน็ต+โทรศัพท์,กล้องวงจรปิดทุกชั้น, เริ่มที่ 2,600 /ด.
en_us: internet + phone, every level of closed circuit camera, beginning at 2,600/mth.

source: เกมส์ทําไอติมผลไม้
en_us: game for making fruit ice cream

source: เธออาศัยอยู่กับพ่อเพียงสองคน
en_us: just the two of them live together, she and her dad

source: เราอาจปฏิเสธที่จะปฏิบัติตามคำร้องขอที่ไม่สำคัญ/เป็นการก่อกวน
en_us: We may decline to comply with requests that are unimportant/constitute harassment.

source: เริ่มที่ 3,400 /ด. 38 เพลส
en_us: beginning at 3,400 /mth. at 38 Place

source: เวอร์ชั่นของทั้งสองภาษา โดยคลิ้กที่ ไอคอนธงชาติ ของแต่ละภาษา ซึ่งไอคอน จะอยู่ ณ ตำแหน่งด้านบน ของแต่ละหน้า เว็บมีคุณลักษณะ
en_us: bilingual version by clicking on the flag icon for each language which is located at the top of each page. The website features

source: แต่ก็ยังต้องหารส่วนแบ่งการตลาดในประเทศไทยให้กับแบรนด์คู่แข่งอยู่ไม่น้อย
en_us: but must divide large portions of the market in Thailand between competing brands

source: แนะนำให้ลองอ่างบทความตามลิงค์ข้างบนนี้ก่อนนะครับ
en_us: recommend first reading the article in the link above.

source: และนอกจากกลุ่มเป้าหมายผู้บริโภคทั่วไปแล้ว
en_us: and besides the general consumer target group

source: โดยล็อกอินเข้าสู่บัญชีของคุณที่
en_us: by logging in to your account at

source: โดยใช้เวลาน้อยนิดในการคัดสรรตัวเลือก ที่พักจาก องค์ประกอบต่างๆ
en_us: by quickly picking accommodation options based on various components

source: ในการสืบค้นที่พัก เพียงคลิ้ก 2-3 ครั้งก็เจอที่พัก
en_us: When searching for accommodations, just click 2-3 times and find an accommodation.

source: (จันทร์-เสาร์) เท่านั้น 202940 สินค้าขายดี
en_us: (Monday-Saturday) only, 202940, bestselling products

source: * ภาพหน้าจอเป็นเพียงภาพแสดงแทน
en_us: * the screen is only a representative image

source: **เนื้อหาส่วนใหญ่มาจากรายการคนอวดผี เทปวันที่ 29 ส.ค. 2555 ***จัดทำขึ้นเพื่อควา...
en_us: **Most content comes from Man vs Ghost taped on Aug. 29, 2012 ***created for...

source: *คลิปนี้อัพใหม่เนื่องจากชาแนลเก่าถูกปิดครับ*
en_us: *This clip was re-uploaded since the old channel was deleted.*

source: 100,000 บาท ใส่จำนวนเงินที่ต้องการตรงนี้ครับ
en_us: 100,000 baht. Enter the amount of money needed here.

source: ขอให้คุณแม่สุขภาพดี
en_us: wish the mother good health

source: ขอให้คู่บ่าวสาวมีความสุข
en_us: wish happiness for the wedding couple.

source: คิดดอกเบี้ยก็ต่อเมื่อกดเงินสด
en_us: adds interest when cash is withdrawn

source: งานราชการไม่ต้องผ่านภาค ก ก.พ.
en_us: the civil service work doesn't have to go through Sector Khor in Feb.

source: จองบ้านและคอนโดออนไลน์
en_us: Reserve a house and condo online.

source: จะเป็นเนื้อผ้าอย่างดีนะครับ
en_us: is made of good material.

source: จากครูบ้านนอกไปติดในเว็บท่าน
en_us: NS

source: ฉันอยากได้ สินเชื่อเงินสด เงินก้อนใหญ่ ครั้งเดียว ผ่อนระยะยาว บัตรกดเงินสด เงินหมุนเวียน
en_us: I want to get a large, one-time cash loan with long-term repayment, ATM card with revolving funds

source: ดูผลการออกสลากงวดอื่นๆ
en_us: See results from other lotteries.

source: ทำให้ผู้คนในหมู่บ้านต่างพากันรังเกียจตัวเขา
en_us: made the people in each of the villages grow to hate him.

source: ประกาศ กองบังคับการสืบสวนสอบสวนตำรวจภูธรภาค ๓ เรื่อง ประกวดราคาจ้าง
en_us: Announcement from the Investigation Division 2 concerning procurement.

source: ประกาศ กองบินตำรวจ เรื่อง ประกวดราคาจ้างปรับปรุงโรงเก็บอากาศยานหมายเลข ๑ และหมายเลข ๒ พร้อมส่วนควบ (ท่าแร้ง)
en_us: Announcment from the Police Aviation Division concerning procurement for remodelling aircraft hangers No. 1 and 2, as well as essential parts (Tha Raeng).

source: สถานะการจ้างงานของฉันคือ
en_us: My employment status is

source: สุขสันต์วันวาเลนไทน์เช่นกันครับ
en_us: Happy Valentines Day to you as well.

source: หางาน พัทยา สมัครงาน งานพัทยา งานราชการ
en_us: Find work, Pattaya, Apply for Work, Pattaya Work, Civil Service Work

source: อยู่ด้วยกันไปอีกปีนึงเลยนะจ๊ะ
en_us: together another year

source: อย่าลืมติดตามมุมกล้องของทุกๆคนเพื่ออรรถรสของการรับชม
en_us: Don't forget to keep track of all camera angles for a more beautiful cinematic experience

source: เจริญใจ เพลส เอกมัย เจริญใจ เพลส เอกมัย 30,000 - 120,000 บาท/เดือน
en_us: Charoenjai Place Ekkamai, Charoenjai Place Ekkamai 30,000 - 120,000 baht/month

source: เพียงตั้งเวลาอัดทุกรายการที่โปรด
en_us: just set a timer to record all the favorite programs

source: เมธัษ อพาร์ตเมนต์ สุขุมวิท 101/1 เมธัษ อพาร์ตเมนต์ สุขุมวิท 101/1 3,000 - 3,700 บาท/เดือน
en_us: Methat Apartments, Sukhumvit 101/1, Methat Apartments, Sukhumvit 101/1, 3,000 - 3,700 baht/month

source: เมื่อวันหนึ่งขณะที่กำลังขี่มอเตอร์ไซค์คู่ใจไปส่งของ
en_us: One day while driving a motorcycle, the lovers made a delivery.

source: แต่นารูโตะมีความใฝ่ฝันอยากจะเป็นนินจาผู้ยิ่งใหญ่
en_us: But Naruto yearned to be a great ninja.

source: แต่ไหนๆก็มาแล้ว
en_us: has come regardless

source: และการประกวดหนูน้อยนพมาศ
en_us: and the child Noppamas pageant

source: และความเกรียนแบบเหนือชั้นเหมือนเดิม
en_us: and overwhelming trollish behavior as usual

source: 9 ม.ค.59 กองทัพเรือ โดย กองเรือยุทธการ
en_us: 9 Jan '16, Navy, by the Ayutthaya fleet

source: จะเป็นใครบ้างมาเช็คกันเลย!
en_us: who it will be, come and check!

source: จากไทยทราเวลเซ็นเตอร์
en_us: from Thai Travel Center

source: ช่วยกระจายความหอมภายในบ้าน
en_us: helps the fragrance suffuse through the house

source: ดูดวงตามปีนักษัตร ชวด ฉลู ขาล เถาะ มะโรง มะเส็ง มะเมีย มะแม วอก ระกา จอ กุน
en_us: NS

source: ดูหนังไทย (80)
en_us: Watch Thai movies (80)

source: ตั้งแต่วันที่ 1-31 ตุลาคม 2559 เท่านั้น
en_us: only between October 1-31, 2016

source: ต่อจากนี้นาฬิกาจะไม่ใช่แค่เครื่องดูเวลาอีกต่อไป
en_us: from now on, watches are no longer just devices for checking the time

source: ทรงเข้ารูป/ทรงสกินนี่
en_us: form-fitting/skinny

source: ที่วางโครงข่ายไว้กว่า 150,000 กิโลเมตรทั่วประเทศ
en_us: which laid over 150,000 kilometers of networks throughout the country

source: บริการสปาและนวดผ่อนคลาย
en_us: spa and relaxing massage service

source: บริษัทจะประกาศแจ้งการเปลี่ยนแปลงให้ทราบอย่างชัดเจนก่อนจะเริ่มดำเนินการเปลี่ยนแปลง
en_us: The company will clearly announce changes before executing those changes.

source: บริษัทจะรีบดำเนินการแจ้งถึงความมีอยู่
en_us: The company will hasten to make notification of availability.

source: บริหารแรงงานไทยไปต่างประเทศ
en_us: administrate overseas employment for Thais

source: ราคาพิเศษโดยเกรียงไทยวัฒนากรุ๊ป
en_us: special price from the Krieng Thai Watana Group

source: วัตถุประสงค์ของการนำข้อมูลไปใช้
en_us: purpose of applying the information

source: ว้าวดารา (แซ่บวัน)
en_us: Wow Dara (Zabb One)

source: สามารถศึกษาเพิ่มเติม คลิก หากพบว่าซิมไม่รองรับ
en_us: NS

source: สำหรับใส่กลางคืน/ชุดราตรี
en_us: nighttime wear / evening dresses

source: สินค้าดี. มีคุณภาพ. เห็นผลชัดเจน ข้อมูลเพิ่มเติม
en_us: NS

source: หรือข้อมูลที่อาจเป็นผลร้าย
en_us: or information that may have a harmful effect

source: หรืออาจส่งประกาศแจ้งเตือนให้ท่านทราบโดยตรง
en_us: or may send you notifications direclty

source: ห้ามนำไปลงที่อื่นเด็ดขาด
en_us: Don't bring anywhere else by any means.

source: เก้าเก ขั้นเทพ - เกมไพ่ไทย
en_us: Advanced Gao Gae - Thai card game

source: เครื่องเล่นเพลงและวิทยุพลังเสียงประสิทธิภาพสูง
en_us: high quality music players and radios

source: เดนิม / ยีนส์
en_us: Denim / Jeans

source: เวปไซต์โครงการ : คลิกที่นี่
en_us: Project Website : Click Here

source: และจะไม่มีการเปิดเผยข้อมูลดังกล่าวแก่บุคคลภายนอกเพื่อวัตถุประสงค์ในด้านการตลาด ผู้ให้บริการ การเปลี่ยนแปลงนโยบายส่วนบุคคล
en_us: NS

source: และรับ-ส่งข้อมูลที่มีไฟล์
en_us: and transfer data with a file

source: แล้วเจอพบกันวันที่ 20 พ.ย. 2559 นะคะ!
en_us: Meet on Nov 20 2016!

source: ใช้งานในเว็บไซต์ของบริษัท
en_us: use on the company website

source: ใช้เน็ตเท่าไหร่ต่อเดือน
en_us: how much internet used per month

source: ได้ให้การสนับสนุนการประกวดวงดนตรีชิงถ้วยประทาน
en_us: was able to support the royal cup battle of the bands

source: “ถ้าพยายาม คำว่าที่สุดคงไม่ไปไหน”
en_us: "Where there is effort, there is the possibility of being the best."

source: “ที่สุดของผม คือการสร้าง ความเปลี่ยนแปลงให้เกิดขึ้นได้จริง”
en_us: "For me the best means creating real change."

source: “ที่สุดของเมย์คือทำทุกก้าวให้ดีที่สุด”
en_us: "The best for May means making every step the best it can be."

source: &apos;ไม่ได้เป็นตัวแทนประกัน&apos; หรือโบรกเกอร์ของบริษัทไหนแน่นอน
en_us: absolutely 'not an insurance agent' or broker for any company

source: 04 พฤศจิกายน 2559 (ร่าง) กำหนดการ กำหนดการประชุมขับเคลื่อนเชิงนโยบายเรือนจำสุขภาวะครั้งที่ 1
en_us: 04 November 2016 (draft) schedule, schedule for the 1st steering committee regarding policy on prison well-being

source: 17/10/16 แจ้งการจดทะเบียนแปลงหุ้นบุริมสิทธิเป็นหุ้นสามัญ
en_us: 17/10/16 Notified registered change of preference share to common share.

source: © 2559 บริษัท กานต์ คาร์เร้นท์ จำกัด สงวนลิขสิทธิ์
en_us: © 2016 Kan Car Rental Company Copyright

source: กลุ่มธุรกิจการเงินเกียรตินาคินภัทร
en_us: Kiatnakin Phatra Financial Group

source: การใช้งานระดับมืออาชีพ
en_us: Professional Use

source: ขนาดกระทัดรัดและรองรับการทำงานไร้สาย
en_us: compact size and guaranteed wireless capability

source: ของขวัญที่เราจะให้นั้น
en_us: That gift that we were going to give

source: ข้อเสนอที่ตรงกับความต้องการ
en_us: proposal in line with what's needed

source: ควรพักโรงแรมไหนดีในแต่ละฤดูกาล!
en_us: The best hotel to stay at for each season!

source: ความจุเตาอบ (ลิตร)
en_us: oven capacity (liters)

source: ความรู้สึกใหม่แห่งการควบคุมอัจฉริยะ
en_us: a new experience in smart controls

source: ค่าประกันอุปกรณ์ 1,000 บาทต่อจุด
en_us: The equipment warranty cost is 1000 baht per point.

source: ค้นหาเลย กลับไปที่ค่าเริ่มต้น
en_us: Search, Reset to default

source: งานราชการ วุฒิ ม 6 ปวช ปวส
en_us: NS

source: งานราชการ วุฒิปริญญาโท, เอก
en_us: NS

source: งานราชการที่ยังไม่ปิดรับสมัครสอบ
en_us: civil service work still holding admissions tests

source: จะยึดถือตามระบบของบริษัทเป็นหลัก
en_us: will still abide by the company system

source: ชอบเงินคืนหรือชอบไมล์
en_us: like cash back or like miles

source: ตรวจสอบและชำระบิลทรูไอเซอร์วิส
en_us: verify and pay True iService bill

source: ตำแหน่งบุคลากรทางการศึกษาอื่นตามมาตรา 38 ค.(2) ✎ 9 พ.ย. 2559
en_us: other educational personnel positions under Section 38 Khor.(2) ✎ 9 Nov 2016

source: ติดต่อเราหรือศูนย์บริการฯ
en_us: Contact us or the service center

source: ทอร์กคอนเวอร์เตอร์
en_us: torque converter

source: ที่ให้คุณเคลื่อนไหวตามที่จินตนาการ
en_us: which helps you move as you imagine

source: ทุกบาท ทุกสตางค์มีค่า
en_us: every baht and every satang has value

source: บริการอื่นๆ ของทรู
en_us: other services from True

source: พนักพิงศีรษะด้านหลัง 3 ตำแหน่งพร้อมปรับระดับสูง - ต่ำได้
en_us: 3 rear headrests with adjustable height

source: พื้นที่วางขาผู้โดยสารด้านหลังมีขนาดใหญ่เกินคลาส
en_us: rear area has lots of legroom for its class

source: พูดคุยกับเราได้ผ่านทาง
en_us: Chat with us through

source: รอบนี้ซื้อได้ไม่มีจำกัด!!
en_us: This time can buy without limit!!

source: รายชื่อหน่วยงานด้านกีฬาที่หักลดหย่อนเงินบริจาคได้ 2 เท่า
en_us: List of sports agencies who have reduced charitable contributions by a factor of 2.

source: วิดีโอที่สมบูรณ์แบบขณะที่คุณเคลื่อนที่
en_us: Perfect video while you move.

source: ศิลปหัตถกรรมนักเรียน ครั้งที่ 66 ปีการศึกษา 2559
en_us: video clip of the 66th Student Handicrafts event for 2016

source: สนง.กศน.
en_us: Office of Non-Formal and Informal Education

source: สนทนาทางวิดีโอสำหรับผู้ที่มีปัญหาทางการได้ยิน
en_us: video chat for those with hearing problems

source: สัญญาณที่บ่งบอกว่าเรากำลังใช้เงินเกินตัว
en_us: signal which indicates we are overspending

source: สั่งพิมพ์จากทุกที่ได้อย่างสะดวก
en_us: conveniently order printing from anywhere

source: สำหรับผู้โดยสารด้านหลัง 2 ตำแหน่ง
en_us: for rear passenger positions

source: หนีเร็วเจ้าสล๊อต!
en_us: Flee, little sloth!

source: หรูหราและมาพร้อมกับสีสันที่สดใส
en_us: luxurious and in bright colors

source: อาจจะเป็นการให้เพื่อการขอบคุณ
en_us: perhaps is a thank you gift

source: เกียร์ธรรมดาซินโครเมท แบบ 5 สปีด
en_us: ordinary 5 speed synchromesh transmission

source: เกียร์ออโตเมติก 6 สปีด
en_us: 6 speed automatic transmission

source: เงินด่วน คำนวนเงินผ่อนต่อเดือนตามจริง
en_us: quick money, calculate the actual monthly installments

source: เบาะนั่งด้านหลังปรับพับได้แบบ 60:40 เพิ่มพื้นที่สำหรับวางสัมภาระได้อย่างเต็มที่
en_us: the rear seat can be folded 60:40 creating more space to place belongings

source: เปรียบเทียบกรมธรรม์ครอบคลุมทุกความต้องการ
en_us: compare insurance policies covering all needs

source: เพียงใส่รายละเอียดไม่กี่อย่างแล้วกดค้นหา
en_us: just enter a few details and click search

source: เพื่อการให้รางวัลหรือไม่
en_us: whether to give an award or not

source: เพื่อให้เหมาะสมกับนโยบายตามสภาพและความต้องการภายในประเทศ
en_us: to accommodate to policies in accordance with the domestic conditions and demand.

source: เราไม่ใช่โบรกเกอร์และไม่ขายผลิตภัณฑ์ใดๆ ทั้งสิ้น
en_us: We are not brokers and do not sell any products.

source: แค่ข้อมูลไม่กี่อย่างก็สามารถดูประกันรถได้ทันที ไทยรัฐ
en_us: just a bit of info and can instantly see car insurance. Thai Rath

source: และช่วยส่งเสริมพฤติกรรมการขับขี่ให้ดียิ่งขึ้น
en_us: and helps improve driving habits.

source: และเคสที่อัพเกรดได้ง่าย
en_us: and cases that are easy to upgrade.

source: ให้คุณจัดการพื้นที่ส่วนตัวได้อย่างลงตัว
en_us: so you can arrange your personal space perfectly.

source: ให้ชีวิต...สบ๊าย สบาย
en_us: So that life...is easy-peasy.

source: ไม่พลาดทุกตอนของซีรีย์โดนใจ
en_us: not miss any episode of favorite series.

source: **ราคาที่เอามาลงในบทความเป็นราคา ณ วันที่เข้าไปเก็บข้อมูลทำรีวิว
en_us: **The price quoted in the article represents the price on the day the information was gathered for the review.

source: กัลฟ์ แอร์ – ฟัลคอนฟลายเออร์
en_us: Gulf Air – Falcon Flyer

source: การที่เราให้ของขวัญไป
en_us: us giving away a gift

source: ขอมองรักด้วยหัวใจ (32)
en_us: Angel Eyes (32)

source: ข้อมูลที่จำเป็นโปรดติดต่อเรา ชื่อเต็ม: .......... หมายเลขโทรศัพท์:.......
en_us: NS

source: คลื่นความถี่ (ตามรุ่น)
en_us: spectrum (by model)

source: ความจุของกระเป๋า (ลิตร)
en_us: bag capacity (liters)

source: จำนวนที่ต้องการจ่ายจริง และ หากมีปัญหาเรื่องใส่ราคาทับกันทางเว็บจะไม่
en_us: actual amount requiring payment and if there is a problem with conflicting prices online

source: ถ้าเรากดปุ่มเปิดแล้วเครื่องยังไม่ทำงานนะครับ
en_us: What if we click the on button and the device still does not work?

source: ทำผิดกติกาที่กระดานนี้ไว้
en_us: break the rules set by this board

source: นัดหมายออนไลน์เพื่อขอทำหนังสือเดินทาง
en_us: make an appointment online to request a passport

source: พลังทำนายอนาคตของโกจิกะ!!
en_us: The clairvoyance of Kochika!!

source: พ็อกเก็ตออลสตาร์
en_us: all-star pocket

source: รับโบนัสอีกทันที 10% อ่านเพิ่มเติม
en_us: Receive instantly another bonus of 10%. Read more.

source: รายการพิเศษ ช่วงวันหยุดนักขัตฤกษ์
en_us: special items on public holidays

source: รูปหล่อรุ่นแรก พระอาจารย์นำ
en_us: first edition statue of Phra Ajahn Nam

source: ลงพระผิดกระดาน หรือ ไม่แจ้งที่มาของพระบ่อยครั้ง
en_us: place a Buddha image on the wrong board or who often do not state the origin of the Buddha image

source: สาธารณรัฐคีร์กีซถาน
en_us: Republic of Kyrgyzstan

source: สำหรับ สมาชิกที่ ไม่สามารถตั้งกระทู้ขายที่กระดานนี้ได้
en_us: For members unable to start a thread for selling on this board.

source: อินสตาแกรมดารา
en_us: Instagram celebrity

source: เทคนิคเก็งกำไรแบบเซียน สไตล์ครูหยง เทคนิคเก็งกำไรแบบเซียน สไตล์ครูหยง
en_us: master techniques for speculating in the style of Teacher Yong, master techniques for speculating in the style of Teacher Yong

source: แต่มีผู้สนับสนุนสินค้าหรือบริการนี้ให้แก่ผู้เขียนรีวิว
en_us: but the reviews for this product or service is sponsored.

source: โปรดสอบถามรายละเอียดจากพนักงานขาย
en_us: Ask the salesperson for details.

source: ใช้เลขศาสตร์ดูดวงของคุณ
en_us: Use numerology to see your horoscope.

source: ใส่เสื้อกันฝนด้วยนะครับ
en_us: Wear a rain jacket too.

source: ไพ่เท๊กซัสมันหยดติ๋ง
en_us: NS

source: ไม่ว่าจะหนังจากค่ายดังๆหรือเล็กๆในไทยก็ตาม
en_us: regardless of whether the film is from a well-known or unheard of festival in Thailand

source: ไม่ใช่เถียงกันหน้าดำหน้าแดงนะครับ
en_us: not seriously arguing.

source: - ติดต่อลุงพี & อ่านคำถามตอบ ได้ในเว็บไซต์ลุงพีเลยจ้า
en_us: - Contact Uncle Phi & read question and answers on Uncle Phi's website.

source: กรุณากรอกตัวอักษรในภาพ
en_us: Please enter characters in the image.

source: กรุณาใส่ ชื่อสินค้า หรือ รหัสสินค้า
en_us: Please enter the name of the product or the product code.

source: จากที่ไหนก็ได้แทบจะทุกแห่ง
en_us: from nearly anywhere at all

source: จำได้ว่าดูภาคแรกเสร็จนี่ออกตามหาซื้อตุ๊กตาแต่หาไม่ได้เลย
en_us: remembers that after seeing the first part, he went out to buy a doll but he couldn't find any.

source: ช้อปดีลออนไลน์ ลดสูงสุด 30%
en_us: shopping deals online, up to 30% off

source: ซึ่งถึงคุณจะไม่ได้
en_us: NS

source: ซึ่งถึงจะมีรูปลักษณ์บางและเบากว่าที่เคย
en_us: which will have a thin and light appearance which

source: ด้วยเซ็นเซอร์ที่ทำงานได้ดีกว่าเดิมและพิกเซลที่ใหญ่ขึ้นเพื่อประสิทธิภาพที่ดียิ่งกว่า
en_us: with an improved sensor and larger pixel resolution for better performance.

source: ตัวหอมฟุ้งกว่าใคร 3/11/2559
en_us: with a better smelling body than anyone 3/11/2016

source: ตามรอยย่างพระบาทที่ยาตรา ตอนที่ 1
en_us: Following In The Royal Footsteps, episode 1

source: ติดตั้ง 4 จุด= 4,000 บาท ( ยกเลิกได้คืน 4,000 บาท)
en_us: 4 points installed = 4,000 baht (refund of 4,000 baht for cancellation)

source: ถึงจะมินิแต่ก็มีอะไรๆ
en_us: Despite its small size, it has good qualities.

source: ทริปตะลุยแดนโอซาก้าที่ญี่ปุ่น
en_us: a brief venture to the Osaka region in Japan

source: ที่ยังไงก็ไม่มีทางลืมได้อย่างแน่นอน
en_us: Regardless, there's absolutely no way to forget.

source: ที่ให้คุณ...โปะได้ ถอนได้ โดยไม่มีค่าธรรมเนียม
en_us: What is given you...can top up or withdraw without fees.

source: พร้อมบริการเเบบทันทีที่คุณต้องการ(คอลเซ็นเตอร์บริการ 24 ชั่วโมง)
en_us: with instant service as you need it (24 hour call center)

source: พลังที่ไม่ได้มินิเหมือนชื่อ
en_us: power that isn't mini like the name

source: พูรูรีลตัวเก่ง!!
en_us: Masterful Purin!!

source: ยูนิลีเวอร์รับประกาศนียบัตรรับรองคาร์บอนฟุตพริ้นท์ของผลิตภัณฑ์ 11/11/2559
en_us: Unilever's products' footprint has been certified 11/11/2016

source: ระบบส่งข้อความทันทีและเว็บบอร์ดฟอรั่ม
en_us: instant messaging system and online forum

source: รับดอกเบี้ยเฉลี่ยต่ำสุด 3.49% ต่อปี* คืนเงินให้ล้านละ 1,500 บาท สมัครวันนี้ - 13 ม.ค. 60
en_us: accepting a minimum interest rate of 3.49% per year* Repay 1,500 baht per million, apply today - 13 Jan 17

source: ลดส่งท้ายปี จองที่พัก รถเช่า ช้อปออนไลน์ สั่งอาหารออนไลน์
en_us: end of the year discounts, reserve accommodations, shop online, order food online

source: สวัสดีครับ วันนี้ผมจะพูดถึงเรื่อง
en_us: Hello. Today I will speak about

source: สินเชื่อบ้านที่คุณโปะได้
en_us: mortgage which you can pay off early

source: หน่วยงานราชการ, สถานทูต, สถาบันการศึกษา
en_us: civil service agencies, embassies, learning institutions

source: หรือจะลงทะเบียนผลิตภัณฑ์ใหม่
en_us: or will register the product again

source: หารหัสสินค้าได้จากที่ไหน?
en_us: Where can the product code be found?

source: เกโคงาชิระปะทะกาเมโนเดส!!
en_us: Frogadier battles Barbaracle!!

source: เคยเห็นตามร้านขายของนำเข้...
en_us: once saw in a store...

source: เครื่องชั่งน้ำหนักและวัดมวลไขมัน
en_us: scale and body fat measuring device

source: เครื่องใช้ไฟฟ้า ราคาพิเศษ (7)
en_us: special priced electrical devices (7)

source: เชิญรับชมได้เลยจ้า!!
en_us: Go ahead and view!!

source: เท่าที่ทราบครับการให้ยูเรียมากเกินไปมีผลทำให้ข้าวลีบ
en_us: As far as I know, giving too much urea causes the rice to wither.

source: เพื่อร่วมกันปกป้องทั้งสองด้านเป็นอย่างดี
en_us: in order to protect both sides well

source: เพื่ออำนวยความสดวกแก่พี่น้องชาวไทยที่ไปร่วมถวายอาลัย พระบา...
en_us: to accomodate the people of Thailand who gather in mourning...

source: เรามีผู้เชี่ยวชาญทางด้านเทคนิคที่สามารถให้บริการควบคุมจากระยะไกล
en_us: We have technological experts who can provide service control from afar.

source: เวอร์ชั่นเบต้าอาจจะไม่เสถียร
en_us: the beta version may not be stable

source: แจ้งการควบรวบสาขา ในวันที่ 28 พ.ย. 2559 สาขาเจริญนคร จะควบรวมสาขาบางแค
en_us: Notification of acquiring a branch on Nov 28, 2016. The Charoen Nakhon branch will merge with the Bang Khae branch.

source: แต่ก็มีขุมพลังแรงพอ
en_us: but there is a powerful enough power source

source: แถมเงินคืนสูงสุด 75,000 บาท
en_us: as well as up to 75,000 baht cash back

source: แนะนำเพื่อนสมัครสินเชื่อบ้านออนไลน์
en_us: recommend a friend to apply for a mortgage online

source: แลกรับเงินคืนสูงสุด 120 บาท
en_us: get a refund of up to 120 baht

source: และยังมีสีสันที่สวยงามมาให้เลือกมากมาย
en_us: and a plethora of beautiful colors to choose from

source: และสาขาเดอะมอลล์ 3 รามคำแหง จะควบรวมกับสาขาทองหล่อ
en_us: and the branch at The Mall at Ramkhamhaeng 3 will merge with the Thonglor branch.

source: และเหล่าฝูงโนวิช
en_us: NS

source: โอนหนี้บัตรเครดิต สินเชื่ออื่น รับดอกเบี้ยพิเศษ 9.99% ต่อปี นาน 12 เดือน
en_us: Transfer credit card debt and other loans and receive a special interest rate of 9.99% per year for 12 months.

source: ในสภาวะที่แสงน้อย สรุปสั้นๆ ได้เลยว่า รูปภาพและวิดีโอทั้งหมด
en_us: In low-light situations, to put it it simply, all picture and video

source: ให้คุณใช้สื่อสารกับผู้เล่นเกมคนอื่นได้
en_us: allowing you to communicate with other gamers

source: ไถเกรียนคือการใช้ปัตตะเลี่ยนไถผมจนเหลือสั้นที่สุด
en_us: A military cut means to use the clippers to trim the hair as short as possible.

source: ไปไหนต่อไหนได้อย่างง่ายดาย
en_us: easily acquired anywhere

source: ไม่ว่าจะพกพาไปที่ไหน
en_us: regardless where taken

source: ไม่ได้ใช้พริกไทยยี่ห้อสวนไทยภารกิจการทำอาหาร
en_us: didn't use Suan Thai brand of pepper, the task of cooking

source: (วงเงินขั้นต่ำ 5,000 บาท และไม่เกินวงเงินรวมตามที่ธนาคารอนุมัติ)
en_us: (a minimum amount of 5,000 baht and not over a total limited approved by the bank)
